%Заповнення бази даних
fill(-1):-!.
fill(X):-asserta(d(X)), X1 is X-1, fill(X1).


%Написати предикат, який генерує всі двозначні числа 

gentwo(X):-d(A), A>0, d(B), X is 10*A+B.

%Знайти всі такі двозначні числа 
task2(X):-d(A), A>0, d(B), X is 10*A+B, X is A*A+B*B*B.

%Знайти всі такі двозначні числа, сума цифр яких ділиться на 13, а різниця між подвійною кількістю їх десятків та одиниць дорівнює 2.
task3(X):-d(A), A>0, d(B), X is 10*A+B, 0 is (A+B) mod 13, 2 is 2*A-B.

%Розв’язати рівняння в невід’ємних цілих числах: X2 + Y3 + Z4 = 4931.
%fill(70).
task4(X, Y, Z) :- d(X), d(Y), Y<18, d(Z) , Z<9, 4931 is X*X + Y*Y*Y + Z*Z*Z*Z.

%Знайти тризначне число, квадрат якого закiнчується трьома однаковими цифрами, вiдмiнними вiд нуля.
task5(X) :- d(A), A>0, d(B), d(C), X is (100*B*B + C*C + 20*B*C + 200*A*C) mod 1000,
                   A is X // 100, B is (X // 10) mod 10, C is X mod 10.

%Розв’язати арифметичний ребус: SEND + MORE = MONEY.
task6(Send, More, Money):-M=1,d(S),S\=M,
           d(E), E \=M, E \= S,
           d(N), N \= M, N\= S, N \= E,
           d(D), D \= M, D \=S, D \= E, D \= N,
           d(O), O \= M, O \=S, O \= E, O \= N, O \= D,
           d(R), R \= M, R \=S, R \= E, R \= N, R \= D, R \= O,
           d(Y),Y \= M, Y \=S, Y \= E, Y \= N, Y \= D, Y \= O, Y \= R,
           Send is S*1000 + E*100 + N*10 + D,
           More is M*1000 + O*100 + R*10 + E,
           Money is M*10000 + O*1000 + N*100 + E*10 + Y,
           Money is  Send + More.
%Довгожитель (людина, яка живе бiльш нiж 100 pокiв) помiтив, що якщо до суми квадратiв цифр його вiку додати число його дня народження (деяке число вiд 1 до 31), то отpимається як раз його вiк. Скiльки pокiв довгожителю?
task7(X):- d(A),d(B), X is 100 + A*10 + B, Y is X - 1 - A*A - B*B, Y=<31,!.